examples/03_pimpleHFDIBFoamFluidisedBedTests/Icosahedrons_n5000/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(pFinal|pcorrFinal)"
    {
        $p;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-8;
        relTol          0.0;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    14;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    consistent         no;
    
    outerCorrectorResidualControl
    {
        p
        {
            tolerance   5e-02;
            relTol      0;
        }
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    residualControl
    {
        p	1e-6;
        U	1e-6;
    }
    pRefCell 101;
    pRefValue 0;
    consistent yes;
}

relaxationFactors
{
    fields
    {
        p           0.5;
        f           0.5;
        
        pFinal      1;
        UFinal      1;
        fFinal      1;
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
